app/views/users/_rc_form.html.haml


        - unless user.payment_provided? || user.stripe_customer_token.present? || user.paypal_recurring_profile_token.present?
          .field
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 1 LIMIT 1