app/controllers/admin_controller.rb

SELECT "visitors".* FROM "visitors" WHERE "visitors"."user_id" = 1 ORDER BY created_at desc
SELECT COUNT(*) FROM "visitors" WHERE "visitors"."user_id" = 1
---
  def visitors
    @user = current_user
    @visitors = @user.visitors.order("created_at desc")
    if @visitors.count == 0

SELECT "visitors".* FROM "visitors" WHERE "visitors"."user_id" = 1 ORDER BY created_at desc
SELECT COUNT(*) FROM "visitors" WHERE "visitors"."user_id" = 1
---
  def export_emails
    @user = current_user
    @visitors = @user.visitors.order("created_at desc")
    if @visitors.count > 0