app/controllers/profiles_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 1 LIMIT 1
SELECT "visitors".* FROM "visitors" WHERE "visitors"."user_id" = 1 LIMIT 1
---
  def show
    @user = User.find_by_id(current_user.id)
    @profile = Profile.find_by_user_id(@user.id)
    @visitor = Visitor.find_by_user_id(@user.id)

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 1 LIMIT 1
SELECT "visitors".* FROM "visitors" WHERE "visitors"."user_id" = 1 LIMIT 1
---
  def create
    @user = User.find_by_id(current_user.id)
    @profile = @user.build_profile(params[:profile])
    @visitor = Visitor.find_by_user_id(@user.id)

SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 1 LIMIT 1
---
  def edit
    @user = current_user
    @profile = Profile.find_by_user_id(@user.id) || @user.build_profile

SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 1 LIMIT 1
UPDATE "profiles" SET "question_three" = 'What is your favorite ACDC song?', "updated_at" = '2012-04-04 03:11:59.336141' WHERE "profiles"."id" = 1
---
  def update
    @user = current_user
    @profile = Profile.find_by_user_id(@user.id) || @user.build_profile
    if @profile.update_attributes(params[:profile])