app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("address", "body", "created_at", "phone", "question_five", "question_four", "question_one", "question_three", "question_two", "subject", "updated_at", "user_id", "video_url") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.find_by_id(current_user.id)
    @profile = @user.build_profile(params[:profile])
    if @profile.save