app/controllers/users_controller.rb

SELECT "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT 1  [["id", "2"]]
---
  def new
    if params[:plan_id]
      plan = Plan.find(params[:plan_id])