app/controllers/visitors_controller.rb

SELECT "users".* FROM "users" WHERE "users"."slug" = 'gmail' LIMIT 1
---
  def new
    @user = User.find_by_slug(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "visitors".* FROM "visitors" WHERE "visitors"."id" = 12 LIMIT 1
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 1 LIMIT 1
INSERT INTO "visitors" ("created_at", "email", "name", "updated_at", "user_id", "welcomed") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.find_by_id(params[:visitor][:user_id])
    @visitor = @user.visitors.build(params[:visitor])
    @profile = Profile.find_by_user_id(@user.id)
    if @visitor.save

SELECT "visitors".* FROM "visitors" WHERE "visitors"."id" = 4 LIMIT 1
DELETE FROM "visitors" WHERE "visitors"."id" = ?  [["id", 4]]
---
  def destroy
    @visitor = Visitor.find_by_id(params[:id])
    if @visitor.destroy