app/controllers/visitors_controller.rb

  def new
    @user = User.find params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "export"]]